# coding=utf-8
# 语言使用排名 https://www.ethnologue.com/
LANGUAGE_CODE_CHOICES = (
    ("en_US", "英语"),
    ("zh_CN", "简体中文"),
    ("fr_FR", "法语"),
    ("es_ES", "西班牙语"),
    ("ar_AE", "阿拉伯语"),
    ("ru_RU", "俄语"),
    # 以上为联合国6种官方语言
    ("pt_BR", "葡萄牙语"),
    ("ja_JP", "日语"),
    ("de_DE", "德语"),
    ("ko_KR", "韩语"),
    ("in_ID", "印尼语"),
    ("ms_MY", "马来语"),
    ("th_TH", "泰语"),
    ("hi_IN", "北印度语"),
    # 印度有多种语言，暂忽略 ("mr_IN", "印度马拉地语"),
    ("tr_TR", "土耳其语"),
    ("it_IT", "意大利语"),
    ("cs_CZ", "捷克语"),
    ("da_DK", "丹麦语"),
    ("nl_NL", "荷兰语"),
    ("no_NO", "挪威语"),
    ("pl_PL", "波兰语"),
    ("ro_RO", "罗马尼亚语"),
    ("sv_SE", "瑞典语"),
    ("tl_PH", "他加禄语-菲律宾"),
)

LANGUAGE_LEVEL = (
    ("A1", "入门级，可以做简单的互动与交流"),
    ("A2", "基础级，能理解并使用熟悉的日常表达法，基本词汇以求满足具体的需求"),
    ("B1", "进阶级，能理解大部分日常生活中常用句子和表达法"),
    ("B2", "高阶级，能在与以目标语言为母语的对象做互动时保持一定流畅度"),
    ("C1", "流利运用级，在社交上、学术上及专业的场合中，皆能灵活的有效地运用语言资源"),
    ("C2", "精通级，能流利、准确、并即兴的表达自己的意见，并且在较为复杂的情况下亦能有效地表达或区别出言外之意"),
)

PHASE_LEVEL = (
    ("preschool", "学前班"),  # 体验式教育，游戏和保育为主
    ("Kindergarten", "幼儿园"),  # 课本教育，小学知识预输入；一般持续1年。
    ("elementary_school", "小学"),
    ("middle_school", "中学"),
    ("high_school", "高中"),
    ("university", "大学"),
)

GRADE_LEVEL = (
    ("preschool", "学前班"),  # 体验式教育，游戏和保育为主
    ("Kindergarten", "幼儿园"),  # 课本教育，小学知识预输入；一般持续1年。
    ("Grade1", "小学一年级"),
    ("Grade2", "小学二年级"),
    ("Grade3", "小学三年级"),
    ("Grade4", "小学四年级"),
    ("Grade5", "小学五年级"),
    ("Grade6", "小学六年级"),  # 部分地区无六年级
    ("Grade7", "初中一年级"),
    ("Grade8", "初中二年级"),
    ("Grade9", "初中三年级"),
    ("Grade10", "高中一年级"),
    ("Grade11", "高中二年级"),
    ("Grade12", "高中三年级"),
)

PRESCHOOL_YEARS = (
    ("3mm-12mm", "3-12months"),
    ("12mm-18mm", "12-18months"),
    ("18mm-2yy", "18months-2years"),
    ("2yy-3yy", "2-3years"),
    ("3yy-5yy", "3-5years"),
)
